Taipapablog-20180816.org
#+HUGO_BASE_DIR: ./

** COMMENT LaTeXをインストールし，texファイルが変更されると，自動的にcompileしてskimでのpdfも自動で更新されるようにする（2018年9月1日追記） :emacs:latex:pdf:skim:beamer:auctex:
   :PROPERTIES:
   :EXPORT_FILE_NAME: latexmk
   :EXPORT_DATE: 2018-08-19
   :EXPORT_HUGO_AUTO_SET_LASTMOD: t
   :EXPORT_HUGO_DRAFT: false
   :EXPORT_AUTHOR: "taipapa"
   :EXPORT_HUGO_TYPE: post
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :header '((image . "headers/琵琶湖.jpg") (caption . "琵琶湖"))
   :END:
*** TeX Live 2018のインストール
    - 参考サイト１：[[https://texwiki.texjp.org/?TeX%20Live][TeX Wiki TeX Live]]
    - 参考サイト２：[[https://texwiki.texjp.org/?TeX%20Live%2FMac][TeX Wiki TeX LiveMac]]
    - 参考サイト３：[[http://www.tug.org/mactex/][The MacTeX-2018 Distribution]]
    - 上記サイトを参考にTeX Live 2018もしくはMacTeX-2018をインストールする．
    - これでスライド作成ソフトであるbeamerも一緒にインストールされる．
    - beamerに固有の設定は特に必要なし．
*** TeX Live 2018のインストール（2018年9月1日追記）
    大事なことを２つ忘れていたので追記する．
**** ヒラギノフォントの埋め込みなど
     - 参考サイト：[[http://doratex.hatenablog.jp/entry/20180501/1525144736][MacTeX 2018のインストール&日本語環境構築法]]
     - こんなところを読んでいないで，直ちに上記のサイトに飛んでいただきたい．
     - マックユーザーにとっての最大の問題点は *「macos標準添付のヒラギノフォントなど商用フォントに関する設定ファイル群が，TeX LiveからTLContriに移動になった」* ということである．この問題に対する対応方法は，すべて上記のサイトに記載されているので，そのとおりにすれば良い．実にありがたい．
**** インストール後のパスの修正（symbolic linkを張る）
     - 参考サイト：[[https://texwiki.texjp.org/?TeX%20Live%2FMac][TeX Wiki TeX LiveMac]]
     - MacTeX 2018を普通にインストールすると，/usr/local/texlive/2018/bin/x86_64-darwin/bibtexというふうにbinの下にx86_64-darwinというdirectoryが入って，tex関連のコマンドのパスが上手く通らなくなる．そこで，上記の[[https://texwiki.texjp.org/?TeX%20Live%2FMac][TeX Wiki TeX LiveMac]]に書いてあるように，/usr/local/binディレクトリの下にsymbolic linkを張る．
       #+begin_src shell
       $ sudo /usr/local/texlive/????/bin/*/tlmgr path add
       #+end_src
     - 上記でうまくいかないときは下記のように具体的なディレクトリ名を指定する．
       #+begin_src shell
       $ sudo /usr/local/texlive/2018/bin/x86_64-darwin/tlmgr path add
       #+end_src

*** auctexのインストールと設定
    - latex文書を扱うなら，Emacsのパッケージであるauctexが最強（according to 独断と偏見）
    - preludeをインストールした時点で，auctexもインストールされる．
    - auctexの設定などについては以下を参照（手抜き..... (^^;;; ）
      + [[https://www.gnu.org/software/auctex/][AUCTEX – Sophisticated document creation]]
      + [[https://texwiki.texjp.org/?AUCTeX][TeX Wiki AUCTeX]]
      + [[https://mytexpert.osdn.jp/index.php?Emacs/AUCTeX][Emacs/AUCTeX]]
      + [[https://skalldan.wordpress.com/2011/07/20/auctex-の設定と便利な機能/][AUCTeX の設定と便利な機能]]
    - しかし，org-modeを使うようになってからは直接latex文書を打つことはめっきり少なくなってしまった．それでも，学会発表用のスライドなどはlatexを直接打って，beamer文書を作成し，pdf原稿に変換している．
***  latexmk
    - Emacsでbeamerを使って，スライド原稿などを作成していると，C-c C-cするたびにtex文書がcompileされてpdf原稿が出来上がるのを待たなければならず，この待ち時間が結構辛い．そこで，tex ファイルの変更が保存されるたびに自動で裏でlatexmkがcompileしてくれるようにする．latexmkを使う．
    - 参考サイト：[[https://texwiki.texjp.org/?Latexmk][TeX Wiki Latexmk]]
    - texlive2018, MacTeXに入っているので，これらを入れていれば別途インストールする必要なし．
    - ~/.latexmkrcの中に以下のように記述する（ちなみに私はxelatexを使用している）
      #+begin_src lisp
        $pdflatex = 'xelatex -interaction=nonstopmode -synctex=1 %O %S';
        $pdf_mode = 1;
        $postscript_mode = $dvi_mode = 0;
        $pdf_previewer  = 'open -a Skim';
        $preview_continuous_mode = 1;  # equivalent to -pvc
      #+end_src
*** 実際の作業
    - 上記のようにセットアップしていることとする．
    - ターミナルで，texファイルが有るdirectoryに移動し，
      #+BEGIN_SRC shell
      latexmk -pvc -pdf -view=none document.tex
      #+END_SRC
    - これで，texファイルへの変更を保存すると自動でコンパイルされて，設定にもよるが，skimで開いているpdfファイルも更新される．
*** XeLaTeXについて
    - 以下を参照されたい．特に最初にあげたZRさんの文書は必読！
      + [[http://zrbabbler.sp.land.to/xelatex.html][XeLaTeX で日本語する件について]]
      + [[https://texwiki.texjp.org/?XeTeX][TeXWiki XeTeX]]
      + [[http://suzusime-log.hatenablog.jp/entry/2017/04/15/210327][XeLaTeXだとかな混植が簡単にできて最高だという話]]
